{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 300, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv1_1_zeropadding"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "conv1_1_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv1_1_zeropadding", 0, 0]]], "name": "conv1_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu1_1"}, "inbound_nodes": [[["conv1_1", 0, 0]]], "name": "relu1_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv1_2_zeropadding"}, "inbound_nodes": [[["relu1_1", 0, 0]]], "name": "conv1_2_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv1_2_zeropadding", 0, 0]]], "name": "conv1_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu1_2"}, "inbound_nodes": [[["conv1_2", 0, 0]]], "name": "relu1_2"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["relu1_2", 0, 0]]], "name": "pool1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv2_1_zeropadding"}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "conv2_1_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv2_1_zeropadding", 0, 0]]], "name": "conv2_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu2_1"}, "inbound_nodes": [[["conv2_1", 0, 0]]], "name": "relu2_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv2_2_zeropadding"}, "inbound_nodes": [[["relu2_1", 0, 0]]], "name": "conv2_2_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv2_2_zeropadding", 0, 0]]], "name": "conv2_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu2_2"}, "inbound_nodes": [[["conv2_2", 0, 0]]], "name": "relu2_2"}, {"class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["relu2_2", 0, 0]]], "name": "pool2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv3_1_zeropadding"}, "inbound_nodes": [[["pool2", 0, 0]]], "name": "conv3_1_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv3_1_zeropadding", 0, 0]]], "name": "conv3_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu3_1"}, "inbound_nodes": [[["conv3_1", 0, 0]]], "name": "relu3_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv3_2_zeropadding"}, "inbound_nodes": [[["relu3_1", 0, 0]]], "name": "conv3_2_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv3_2_zeropadding", 0, 0]]], "name": "conv3_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu3_2"}, "inbound_nodes": [[["conv3_2", 0, 0]]], "name": "relu3_2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv3_3_zeropadding"}, "inbound_nodes": [[["relu3_2", 0, 0]]], "name": "conv3_3_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv3_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv3_3_zeropadding", 0, 0]]], "name": "conv3_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu3_3"}, "inbound_nodes": [[["conv3_3", 0, 0]]], "name": "relu3_3"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["relu3_3", 0, 0]]], "name": "pool3"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv4_1_zeropadding"}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "conv4_1_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv4_1_zeropadding", 0, 0]]], "name": "conv4_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu4_1"}, "inbound_nodes": [[["conv4_1", 0, 0]]], "name": "relu4_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv4_2_zeropadding"}, "inbound_nodes": [[["relu4_1", 0, 0]]], "name": "conv4_2_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv4_2_zeropadding", 0, 0]]], "name": "conv4_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu4_2"}, "inbound_nodes": [[["conv4_2", 0, 0]]], "name": "relu4_2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv4_3_zeropadding"}, "inbound_nodes": [[["relu4_2", 0, 0]]], "name": "conv4_3_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv4_3_zeropadding", 0, 0]]], "name": "conv4_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu4_3"}, "inbound_nodes": [[["conv4_3", 0, 0]]], "name": "relu4_3"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["relu4_3", 0, 0]]], "name": "pool4"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv5_1_zeropadding"}, "inbound_nodes": [[["pool4", 0, 0]]], "name": "conv5_1_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv5_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv5_1_zeropadding", 0, 0]]], "name": "conv5_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu5_1"}, "inbound_nodes": [[["conv5_1", 0, 0]]], "name": "relu5_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv5_2_zeropadding"}, "inbound_nodes": [[["relu5_1", 0, 0]]], "name": "conv5_2_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv5_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv5_2_zeropadding", 0, 0]]], "name": "conv5_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu5_2"}, "inbound_nodes": [[["conv5_2", 0, 0]]], "name": "relu5_2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv5_3_zeropadding"}, "inbound_nodes": [[["relu5_2", 0, 0]]], "name": "conv5_3_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv5_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv5_3_zeropadding", 0, 0]]], "name": "conv5_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu5_3"}, "inbound_nodes": [[["conv5_3", 0, 0]]], "name": "relu5_3"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "pool5_zeropadding"}, "inbound_nodes": [[["relu5_3", 0, 0]]], "name": "pool5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["pool5_zeropadding", 0, 0]]], "name": "pool5"}, {"class_name": "ZeroPadding2D", "config": {"padding": [6, 6], "trainable": true, "name": "fc6_zeropadding"}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "fc6_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fc6", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fc6_zeropadding", 0, 0]]], "name": "fc6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu6"}, "inbound_nodes": [[["fc6", 0, 0]]], "name": "relu6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fc7", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["relu6", 0, 0]]], "name": "fc7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu7"}, "inbound_nodes": [[["fc7", 0, 0]]], "name": "relu7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv6_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["relu7", 0, 0]]], "name": "conv6_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv6_1_relu"}, "inbound_nodes": [[["conv6_1", 0, 0]]], "name": "conv6_1_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv6_2_zeropadding"}, "inbound_nodes": [[["conv6_1_relu", 0, 0]]], "name": "conv6_2_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv6_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv6_2_zeropadding", 0, 0]]], "name": "conv6_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv6_2_relu"}, "inbound_nodes": [[["conv6_2", 0, 0]]], "name": "conv6_2_relu"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv7_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["conv6_2_relu", 0, 0]]], "name": "conv7_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv7_1_relu"}, "inbound_nodes": [[["conv7_1", 0, 0]]], "name": "conv7_1_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv7_2_zeropadding"}, "inbound_nodes": [[["conv7_1_relu", 0, 0]]], "name": "conv7_2_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv7_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv7_2_zeropadding", 0, 0]]], "name": "conv7_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv7_2_relu"}, "inbound_nodes": [[["conv7_2", 0, 0]]], "name": "conv7_2_relu"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv8_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["conv7_2_relu", 0, 0]]], "name": "conv8_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv8_1_relu"}, "inbound_nodes": [[["conv8_1", 0, 0]]], "name": "conv8_1_relu"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv8_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv8_1_relu", 0, 0]]], "name": "conv8_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv8_2_relu"}, "inbound_nodes": [[["conv8_2", 0, 0]]], "name": "conv8_2_relu"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv9_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["conv8_2_relu", 0, 0]]], "name": "conv9_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv9_1_relu"}, "inbound_nodes": [[["conv9_1", 0, 0]]], "name": "conv9_1_relu"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv9_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv9_1_relu", 0, 0]]], "name": "conv9_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "conv4_3_norm", "epsilon": 9.999999747378752e-06, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["relu4_3", 0, 0]]], "name": "conv4_3_norm"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv9_2_relu"}, "inbound_nodes": [[["conv9_2", 0, 0]]], "name": "conv9_2_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv4_3_norm_mbox_conf_zeropadding"}, "inbound_nodes": [[["conv4_3_norm", 0, 0]]], "name": "conv4_3_norm_mbox_conf_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "fc7_mbox_conf_zeropadding"}, "inbound_nodes": [[["relu7", 0, 0]]], "name": "fc7_mbox_conf_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv6_2_mbox_conf_zeropadding"}, "inbound_nodes": [[["conv6_2_relu", 0, 0]]], "name": "conv6_2_mbox_conf_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv7_2_mbox_conf_zeropadding"}, "inbound_nodes": [[["conv7_2_relu", 0, 0]]], "name": "conv7_2_mbox_conf_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv8_2_mbox_conf_zeropadding"}, "inbound_nodes": [[["conv8_2_relu", 0, 0]]], "name": "conv8_2_mbox_conf_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv9_2_mbox_conf_zeropadding"}, "inbound_nodes": [[["conv9_2_relu", 0, 0]]], "name": "conv9_2_mbox_conf_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv4_3_norm_mbox_loc_zeropadding"}, "inbound_nodes": [[["conv4_3_norm", 0, 0]]], "name": "conv4_3_norm_mbox_loc_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "fc7_mbox_loc_zeropadding"}, "inbound_nodes": [[["relu7", 0, 0]]], "name": "fc7_mbox_loc_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv6_2_mbox_loc_zeropadding"}, "inbound_nodes": [[["conv6_2_relu", 0, 0]]], "name": "conv6_2_mbox_loc_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv7_2_mbox_loc_zeropadding"}, "inbound_nodes": [[["conv7_2_relu", 0, 0]]], "name": "conv7_2_mbox_loc_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv8_2_mbox_loc_zeropadding"}, "inbound_nodes": [[["conv8_2_relu", 0, 0]]], "name": "conv8_2_mbox_loc_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv9_2_mbox_loc_zeropadding"}, "inbound_nodes": [[["conv9_2_relu", 0, 0]]], "name": "conv9_2_mbox_loc_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4_3_norm_mbox_conf", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 84, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv4_3_norm_mbox_conf_zeropadding", 0, 0]]], "name": "conv4_3_norm_mbox_conf"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fc7_mbox_conf", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 126, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fc7_mbox_conf_zeropadding", 0, 0]]], "name": "fc7_mbox_conf"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv6_2_mbox_conf", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 126, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv6_2_mbox_conf_zeropadding", 0, 0]]], "name": "conv6_2_mbox_conf"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv7_2_mbox_conf", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 126, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv7_2_mbox_conf_zeropadding", 0, 0]]], "name": "conv7_2_mbox_conf"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv8_2_mbox_conf", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 84, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv8_2_mbox_conf_zeropadding", 0, 0]]], "name": "conv8_2_mbox_conf"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv9_2_mbox_conf", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 84, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv9_2_mbox_conf_zeropadding", 0, 0]]], "name": "conv9_2_mbox_conf"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv4_3_norm_mbox_loc", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv4_3_norm_mbox_loc_zeropadding", 0, 0]]], "name": "conv4_3_norm_mbox_loc"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fc7_mbox_loc", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fc7_mbox_loc_zeropadding", 0, 0]]], "name": "fc7_mbox_loc"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv6_2_mbox_loc", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv6_2_mbox_loc_zeropadding", 0, 0]]], "name": "conv6_2_mbox_loc"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv7_2_mbox_loc", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv7_2_mbox_loc_zeropadding", 0, 0]]], "name": "conv7_2_mbox_loc"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv8_2_mbox_loc", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv8_2_mbox_loc_zeropadding", 0, 0]]], "name": "conv8_2_mbox_loc"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv9_2_mbox_loc", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["conv9_2_mbox_loc_zeropadding", 0, 0]]], "name": "conv9_2_mbox_loc"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_2"}, "inbound_nodes": [[["conv4_3_norm_mbox_conf", 0, 0]]], "name": "permute_2"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_4"}, "inbound_nodes": [[["fc7_mbox_conf", 0, 0]]], "name": "permute_4"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_6"}, "inbound_nodes": [[["conv6_2_mbox_conf", 0, 0]]], "name": "permute_6"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_8"}, "inbound_nodes": [[["conv7_2_mbox_conf", 0, 0]]], "name": "permute_8"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_10"}, "inbound_nodes": [[["conv8_2_mbox_conf", 0, 0]]], "name": "permute_10"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_12"}, "inbound_nodes": [[["conv9_2_mbox_conf", 0, 0]]], "name": "permute_12"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_1"}, "inbound_nodes": [[["conv4_3_norm_mbox_loc", 0, 0]]], "name": "permute_1"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_3"}, "inbound_nodes": [[["fc7_mbox_loc", 0, 0]]], "name": "permute_3"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_5"}, "inbound_nodes": [[["conv6_2_mbox_loc", 0, 0]]], "name": "permute_5"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_7"}, "inbound_nodes": [[["conv7_2_mbox_loc", 0, 0]]], "name": "permute_7"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_9"}, "inbound_nodes": [[["conv8_2_mbox_loc", 0, 0]]], "name": "permute_9"}, {"class_name": "Permute", "config": {"dims": [2, 3, 1], "trainable": true, "name": "permute_11"}, "inbound_nodes": [[["conv9_2_mbox_loc", 0, 0]]], "name": "permute_11"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv4_3_norm_mbox_conf_flat"}, "inbound_nodes": [[["permute_2", 0, 0]]], "name": "conv4_3_norm_mbox_conf_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "fc7_mbox_conf_flat"}, "inbound_nodes": [[["permute_4", 0, 0]]], "name": "fc7_mbox_conf_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv6_2_mbox_conf_flat"}, "inbound_nodes": [[["permute_6", 0, 0]]], "name": "conv6_2_mbox_conf_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv7_2_mbox_conf_flat"}, "inbound_nodes": [[["permute_8", 0, 0]]], "name": "conv7_2_mbox_conf_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv8_2_mbox_conf_flat"}, "inbound_nodes": [[["permute_10", 0, 0]]], "name": "conv8_2_mbox_conf_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv9_2_mbox_conf_flat"}, "inbound_nodes": [[["permute_12", 0, 0]]], "name": "conv9_2_mbox_conf_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv4_3_norm_mbox_loc_flat"}, "inbound_nodes": [[["permute_1", 0, 0]]], "name": "conv4_3_norm_mbox_loc_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "fc7_mbox_loc_flat"}, "inbound_nodes": [[["permute_3", 0, 0]]], "name": "fc7_mbox_loc_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv6_2_mbox_loc_flat"}, "inbound_nodes": [[["permute_5", 0, 0]]], "name": "conv6_2_mbox_loc_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv7_2_mbox_loc_flat"}, "inbound_nodes": [[["permute_7", 0, 0]]], "name": "conv7_2_mbox_loc_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv8_2_mbox_loc_flat"}, "inbound_nodes": [[["permute_9", 0, 0]]], "name": "conv8_2_mbox_loc_flat"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "conv9_2_mbox_loc_flat"}, "inbound_nodes": [[["permute_11", 0, 0]]], "name": "conv9_2_mbox_loc_flat"}, {"class_name": "Merge", "config": {"name": "mbox_conf", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv4_3_norm_mbox_conf_flat", 0, 0], ["fc7_mbox_conf_flat", 0, 0], ["conv6_2_mbox_conf_flat", 0, 0], ["conv7_2_mbox_conf_flat", 0, 0], ["conv8_2_mbox_conf_flat", 0, 0], ["conv9_2_mbox_conf_flat", 0, 0]]], "name": "mbox_conf"}, {"class_name": "Merge", "config": {"name": "mbox_loc", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["conv4_3_norm_mbox_loc_flat", 0, 0], ["fc7_mbox_loc_flat", 0, 0], ["conv6_2_mbox_loc_flat", 0, 0], ["conv7_2_mbox_loc_flat", 0, 0], ["conv8_2_mbox_loc_flat", 0, 0], ["conv9_2_mbox_loc_flat", 0, 0]]], "name": "mbox_loc"}, {"class_name": "Reshape", "config": {"target_shape": [11786, 21], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["mbox_conf", 0, 0]]], "name": "reshape_1"}, {"class_name": "PriorBox", "config": {"trainable": true, "name": "priorbox_1"}, "inbound_nodes": [[["conv4_3_norm", 0, 0]]], "name": "priorbox_1"}, {"class_name": "PriorBox", "config": {"trainable": true, "name": "priorbox_2"}, "inbound_nodes": [[["relu7", 0, 0]]], "name": "priorbox_2"}, {"class_name": "PriorBox", "config": {"trainable": true, "name": "priorbox_3"}, "inbound_nodes": [[["conv6_2_relu", 0, 0]]], "name": "priorbox_3"}, {"class_name": "PriorBox", "config": {"trainable": true, "name": "priorbox_4"}, "inbound_nodes": [[["conv7_2_relu", 0, 0]]], "name": "priorbox_4"}, {"class_name": "PriorBox", "config": {"trainable": true, "name": "priorbox_5"}, "inbound_nodes": [[["conv8_2_relu", 0, 0]]], "name": "priorbox_5"}, {"class_name": "PriorBox", "config": {"trainable": true, "name": "priorbox_6"}, "inbound_nodes": [[["conv9_2_relu", 0, 0]]], "name": "priorbox_6"}, {"class_name": "Reshape", "config": {"target_shape": [11786, 4], "trainable": true, "name": "mbox_loc_logits"}, "inbound_nodes": [[["mbox_loc", 0, 0]]], "name": "mbox_loc_logits"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "mbox_conf_softmax"}, "inbound_nodes": [[["reshape_1", 0, 0]]], "name": "mbox_conf_softmax"}, {"class_name": "Merge", "config": {"name": "mbox_priorbox", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["priorbox_1", 0, 0], ["priorbox_2", 0, 0], ["priorbox_3", 0, 0], ["priorbox_4", 0, 0], ["priorbox_5", 0, 0], ["priorbox_6", 0, 0]]], "name": "mbox_priorbox"}, {"class_name": "Merge", "config": {"name": "predictions", "concat_axis": 2, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["mbox_loc_logits", 0, 0], ["mbox_conf_softmax", 0, 0], ["mbox_priorbox", 0, 0]]], "name": "predictions"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "model_9"}}